/* 價格表 */
const priceData = {
    "01": { // 01 02 03 05 06 07 11
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':149000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':157000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':228500
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':228000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':288000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':105000
                },
                '118 x 208 cm':{
                    '非甲級':92000,
                    '甲級':113000
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':156000
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':156000
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':200000
                }
            },
        },
    "02": { // 01 02 03 05 06 07 11
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':149000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':157000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':228500
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':228000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':288000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':105000
                },
                '118 x 208 cm':{
                    '非甲級':92000,
                    '甲級':113000
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':156000
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':156000
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':200000
                }
            },
        },
    "03": { // 01 02 03 05 06 07 11
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':149000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':157000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':228500
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':228000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':288000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':105000
                },
                '118 x 208 cm':{
                    '非甲級':92000,
                    '甲級':113000
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':156000
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':156000
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':200000
                }
            },
        },
    "05": { // 01 02 03 05 06 07 11
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':149000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':157000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':228500
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':228000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':288000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':105000
                },
                '118 x 208 cm':{
                    '非甲級':92000,
                    '甲級':113000
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':156000
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':156000
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':200000
                }
            },
        },
    "06": { // 01 02 03 05 06 07 11
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':149000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':157000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':228500
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':228000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':288000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':105000
                },
                '118 x 208 cm':{
                    '非甲級':92000,
                    '甲級':113000
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':156000
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':156000
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':200000
                }
            },
        },
    "07": { // 01 02 03 05 06 07 11
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':149000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':157000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':228500
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':228000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':288000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':105000
                },
                '118 x 208 cm':{
                    '非甲級':92000,
                    '甲級':113000
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':156000
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':156000
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':200000
                }
            },
        },
    
    "08": { // 08 09 10
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 135600,
                    '甲級':156000
                },
                '118 x 208 cm':{
                    '非甲級':143600,
                    '甲級':164000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':203000,
                    '甲級':241000
                },
                '150 x 208 cm':{
                    '非甲級':223500,
                    '甲級':241000
                },
                '151 x 208 cm':{
                    '非甲級':264000,
                    '甲級':302000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 91600,
                    '甲級':112600
                },
                '118 x 208 cm':{
                    '非甲級':99600,
                    '甲級':120600
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':137500,
                    '甲級':169000
                },
                '150 x 208 cm':{
                    '非甲級':151000,
                    '甲級':169000
                },
                '151 x 208 cm':{
                    '非甲級':178500,
                    '甲級':215000
                }
            },
        },
    "09": { // 08 09 10
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 135600,
                    '甲級':156000
                },
                '118 x 208 cm':{
                    '非甲級':143600,
                    '甲級':164000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':203000,
                    '甲級':241000
                },
                '150 x 208 cm':{
                    '非甲級':223500,
                    '甲級':241000
                },
                '151 x 208 cm':{
                    '非甲級':264000,
                    '甲級':302000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 91600,
                    '甲級':112600
                },
                '118 x 208 cm':{
                    '非甲級':99600,
                    '甲級':120600
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':137500,
                    '甲級':169000
                },
                '150 x 208 cm':{
                    '非甲級':151000,
                    '甲級':169000
                },
                '151 x 208 cm':{
                    '非甲級':178500,
                    '甲級':215000
                }
            },
        },
    "10": { // 08 09 10
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 135600,
                    '甲級':156000
                },
                '118 x 208 cm':{
                    '非甲級':143600,
                    '甲級':164000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':203000,
                    '甲級':241000
                },
                '150 x 208 cm':{
                    '非甲級':223500,
                    '甲級':241000
                },
                '151 x 208 cm':{
                    '非甲級':264000,
                    '甲級':302000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 91600,
                    '甲級':112600
                },
                '118 x 208 cm':{
                    '非甲級':99600,
                    '甲級':120600
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':137500,
                    '甲級':169000
                },
                '150 x 208 cm':{
                    '非甲級':151000,
                    '甲級':169000
                },
                '151 x 208 cm':{
                    '非甲級':178500,
                    '甲級':215000
                }
            },
        },
    "11": { // 01 02 03 05 06 07 11
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':149000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':157000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':228500
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':228000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':288000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':105000
                },
                '118 x 208 cm':{
                    '非甲級':92000,
                    '甲級':113000
                }
            },
            "內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':156000
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':156000
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':200000
                }
            },
        },
    
    "12": { // 12
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 116000,
                    '甲級':141000
                },
                '118 x 208 cm':{
                    '非甲級':124000,
                    '甲級':149000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':174000,
                    '甲級':215500
                },
                '150 x 208 cm':{
                    '非甲級':191500,
                    '甲級':215500
                },
                '151 x 208 cm':{
                    '非甲級':226000,
                    '甲級':272000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "石角內門": {
                '100 x 208 cm':{
                    '非甲級': 72000,
                    '甲級':97000
                },
                '118 x 208 cm':{
                    '非甲級':80000,
                    '甲級':105000
                }
            },
            "石角內門子母門":{
                '140 x 208 cm':{
                    '非甲級':112000,
                    '甲級':147500
                },
                '150 x 208 cm':{
                    '非甲級':123000,
                    '甲級':147500
                },
                '151 x 208 cm':{
                    '非甲級':145500,
                    '甲級':184000
                }
            },
        },

    "13": { // 13
            "雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 128000,
                    '甲級':153000
                },
                '118 x 208 cm':{
                    '非甲級':136000,
                    '甲級':161000
                }
            },
            "雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':192000,
                    '甲級':236000
                },
                '150 x 208 cm':{
                    '非甲級':211000,
                    '甲級':236000
                },
                '151 x 208 cm':{
                    '非甲級':249500,
                    '甲級':296000
                }
            },
            "外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "小金剛內門": {
                '100 x 208 cm':{
                    '非甲級': 84000,
                    '甲級':109000
                },
                '118 x 208 cm':{
                    '非甲級':97000,
                    '甲級':117000
                }
            },
            "小金剛內門子母門":{
                '140 x 208 cm':{
                    '非甲級':126000,
                    '甲級':162500
                },
                '150 x 208 cm':{
                    '非甲級':138500,
                    '甲級':162500
                },
                '151 x 208 cm':{
                    '非甲級':163500,
                    '甲級':208000
                }
            },
        },
    
    "15": { // 15
            "迷你金剛·染黑橡木雙玄關": {
                '100 x 208 cm':{
                    '非甲級': 146000,
                    '甲級':167000
                },
                '118 x 208 cm':{
                    '非甲級':154000,
                    '甲級':175000
                }
            },
            "迷你金剛·染黑橡木雙玄關子母門":{
                '140 x 208 cm':{
                    '非甲級':219000,
                    '甲級':258500
                },
                '150 x 208 cm':{
                    '非甲級':241000,
                    '甲級':258500
                },
                '151 x 208 cm':{
                    '非甲級':285000,
                    '甲級':324000
                }
            },
            "琴棋外門": {
                '100 x 208 cm':{
                    '非甲級': 55000
                },
                '118 x 208 cm':{
                    '非甲級':63000
                }
            },
            "琴棋外門子母門":{
                '140 x 208 cm':{
                    '非甲級':82000
                },
                '150 x 208 cm':{
                    '非甲級':90000
                },
                '151 x 208 cm':{
                    '非甲級':106500
                }
            },
            "迷你金剛·染黑橡木內門": {
                '100 x 208 cm':{
                    '非甲級': 99000,
                    '甲級':122000
                },
                '118 x 208 cm':{
                    '非甲級':112000,
                    '甲級':133000
                }
            },
            "迷你金剛·染黑橡木內門子母門":{
                '140 x 208 cm':{
                    '非甲級':148500,
                    '甲級':193000
                },
                '150 x 208 cm':{
                    '非甲級':163500,
                    '甲級':193000
                },
                '151 x 208 cm':{
                    '非甲級':193000,
                    '甲級':234000
                }
            },
            "雙面迷你金剛內門": {
                '100 x 208 cm':{
                    '非甲級': 110000,
                    '甲級':135000
                },
                '118 x 208 cm':{
                    '非甲級':123000,
                    '甲級':148000
                }
            },
            "雙面迷你金剛內門子母門":{
                '140 x 208 cm':{
                    '非甲級':165000,
                    '甲級':214000
                },
                '150 x 208 cm':{
                    '非甲級':181500,
                    '甲級':214000
                },
                '151 x 208 cm':{
                    '非甲級':214500,
                    '甲級':260000
                }
            },
        },
    };

/*表格清單*/
const tableData = {
    "01": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 149,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 157,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 228,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 228,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 288,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 105,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 92,000", price2: "$ 113,000" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 156,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 156,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 200,000" }
    ],
    "02": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 149,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 157,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 228,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 228,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 288,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 105,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 92,000", price2: "$ 113,000" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 156,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 156,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 200,000" }
    ],
    "03": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 149,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 157,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 228,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 228,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 288,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 105,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 92,000", price2: "$ 113,000" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 156,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 156,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 200,000" }
    ],
    "05": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 149,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 157,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 228,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 228,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 288,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 105,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 92,000", price2: "$ 113,000" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 156,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 156,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 200,000" }
    ],
    "06": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 149,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 157,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 228,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 228,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 288,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 105,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 92,000", price2: "$ 113,000" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 156,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 156,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 200,000" }
    ],
    "07": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 149,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 157,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 228,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 228,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 288,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 105,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 92,000", price2: "$ 113,000" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 156,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 156,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 200,000" }
    ],
    "08": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 135,600", price2: "$ 156,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 143,600", price2: "$ 164,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 203,000", price2: "$ 241,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 223,500", price2: "$ 241,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 264,000", price2: "$ 302,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 91,600", price2: "$ 112,600" },
        { type: "", size: "118 x 208 cm", price1: "$ 99,600", price2: "$ 120,600" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 137,500", price2: "$ 169,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 151,000", price2: "$ 169,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 178,500", price2: "$ 215,000" }
    ],
    "09": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 135,600", price2: "$ 156,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 143,600", price2: "$ 164,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 203,000", price2: "$ 241,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 223,500", price2: "$ 241,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 264,000", price2: "$ 302,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 91,600", price2: "$ 112,600" },
        { type: "", size: "118 x 208 cm", price1: "$ 99,600", price2: "$ 120,600" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 137,500", price2: "$ 169,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 151,000", price2: "$ 169,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 178,500", price2: "$ 215,000" }
    ],
    "10": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 135,600", price2: "$ 156,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 143,600", price2: "$ 164,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 203,000", price2: "$ 241,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 223,500", price2: "$ 241,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 264,000", price2: "$ 302,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 91,600", price2: "$ 112,600" },
        { type: "", size: "118 x 208 cm", price1: "$ 99,600", price2: "$ 120,600" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 137,500", price2: "$ 169,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 151,000", price2: "$ 169,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 178,500", price2: "$ 215,000" }
    ],
    "11": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 149,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 157,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 228,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 228,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 288,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 105,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 92,000", price2: "$ 113,000" },
        { type: "內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 156,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 156,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 200,000" }
    ],
    "12": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 116,000", price2: "$ 141,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 124,000", price2: "$ 149,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 174,000", price2: "$ 215,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 191,500", price2: "$ 215,500" },
        { type: "", size: "151 x 208 cm", price1: "$ 226,000", price2: "$ 272,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "石角內門", size: "100 x 208 cm", price1: "$ 72,000", price2: "$ 97,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 80,000", price2: "$ 105,000" },
        { type: "石角內門子母門", size: "140 x 208 cm", price1: "$ 112,000", price2: "$ 147,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 123,000", price2: "$ 147,500" },
        { type: "", size: "151 x 208 cm", price1: "$ 145,500", price2: "$ 184,000" }
    ],
    "13": [
        { type: "雙玄關", size: "100 x 208 cm", price1: "$ 128,000", price2: "$ 153,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 136,000", price2: "$ 161,000" },
        { type: "雙玄關子母門", size: "140 x 208 cm", price1: "$ 192,000", price2: "$ 236,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 211,000", price2: "$ 236,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 249,500", price2: "$ 296,000" },
        { type: "外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "小金剛內門", size: "100 x 208 cm", price1: "$ 84,000", price2: "$ 109,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 97,000", price2: "$ 117,000" },
        { type: "小金剛內門子母門", size: "140 x 208 cm", price1: "$ 126,000", price2: "$ 162,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 138,500", price2: "$ 162,500" },
        { type: "", size: "151 x 208 cm", price1: "$ 163,500", price2: "$ 208,000" }
    ],
    "15": [
        { type: "迷你金剛·染黑橡木雙玄關", size: "100 x 208 cm", price1: "$ 146,000", price2: "$ 167,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 154,000", price2: "$ 175,000" },
        { type: "迷你金剛·染黑橡木雙玄關子母門", size: "140 x 208 cm", price1: "$ 219,000", price2: "$ 258,500" },
        { type: "", size: "150 x 208 cm", price1: "$ 241,000", price2: "$ 258,500" },
        { type: "", size: "151 x 208 cm", price1: "$ 285,000", price2: "$ 324,000" },
        { type: "琴棋外門", size: "100 x 208 cm", price1: "$ 55,000", price2: "x" },
        { type: "", size: "118 x 208 cm", price1: "$ 63,000", price2: "x" },
        { type: "琴棋外門子母門", size: "140 x 208 cm", price1: "$ 82,000", price2: "x" },
        { type: "", size: "150 x 208 cm", price1: "$ 90,000", price2: "x" },
        { type: "", size: "151 x 208 cm", price1: "$ 106,500", price2: "x" },
        { type: "迷你金剛·染黑橡木內門", size: "100 x 208 cm", price1: "$ 99,000", price2: "$ 122,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 112,000", price2: "$ 133,000" },
        { type: "迷你金剛·染黑橡木內門子母門", size: "140 x 208 cm", price1: "$ 148,500", price2: "$ 193,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 163,500", price2: "$ 193,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 193,000", price2: "$ 234,000" },
        { type: "雙面迷你金剛內門", size: "100 x 208 cm", price1: "$ 110,000", price2: "$ 135,000" },
        { type: "", size: "118 x 208 cm", price1: "$ 123,000", price2: "$ 148,000" },
        { type: "雙面迷你金剛內門子母門", size: "140 x 208 cm", price1: "$ 165,000", price2: "$ 214,000" },
        { type: "", size: "150 x 208 cm", price1: "$ 181,500", price2: "$ 214,000" },
        { type: "", size: "151 x 208 cm", price1: "$ 214,500", price2: "$ 260,000" }
    ]
};
    
const priceTableBody = document.getElementById('price-table-body');

const numberSelect = document.getElementById('number-select');
const typeSelect = document.getElementById('type-select');
const sizeSelect = document.getElementById('size-select');
const fireSelect = document.getElementById('fire-select');
const priceSpan = document.getElementById('total-price');

// 型號
    numberSelect.onchange = function() {
        const number = this.value;
        const types = priceData[number]; 

        //選完型號之後選門型
        typeSelect.innerHTML = '<option value="" disabled selected>請選型號</option>'; 
        sizeSelect.innerHTML = '<option value="" disabled selected>請選擇尺寸</option>';
        fireSelect.innerHTML = '<option value="" disabled selected>請選擇尺寸</option>';
        priceSpan.innerText = "0";  

        // 
        for (let type in types) {
            const opt = document.createElement('option');
            opt.value = type;
            opt.innerHTML = type;
            typeSelect.appendChild(opt);
        }
    };

    //
    typeSelect.onchange = function() {
        const number = numberSelect.value;
        const type = this.value;
        
        
        const sizes = priceData[number][type];

       
        sizeSelect.innerHTML = '<option value="" disabled selected>請選擇尺寸</option>';
        fireSelect.innerHTML = '<option value="" disabled selected>請先選擇尺寸</option>';
        priceSpan.innerText = "0";  

      
        for (let size in sizes) {
            const opt = document.createElement('option');
            opt.value = size;
            opt.innerHTML = size;
            sizeSelect.appendChild(opt);
        }
    };

    // 選完門型選尺寸
    sizeSelect.onchange = function() {
        const number = numberSelect.value; 
        const type = typeSelect.value;
        const size = this.value;
        
        
        const fireOptions = priceData[number][type][size];
        

        fireSelect.innerHTML = '<option value="" disabled selected>請選擇防火等級</option>';
        priceSpan.innerText = "0"; 


        const firelevels = Object.keys(fireOptions);
        firelevels.forEach(function(level) {
            const opt = document.createElement('option');
            opt.value = level;
            opt.innerHTML = level;
            fireSelect.appendChild(opt);
        });
    };  

    // 防火
    fireSelect.onchange = function() {
        const number = numberSelect.value;
        const type = typeSelect.value;
        const size = sizeSelect.value;
        const fire = this.value;

    // 算錢
        const finalPrice = priceData[number][type][size][fire];
        priceSpan.innerText = finalPrice.toLocaleString();

    };
   

    
// =============
// 點擊選單換圖
// =============

const patternSpecs = {
    "01": [
        '咖啡砂閃銀色',
        '皓月(雙面造型)'
    ],
    "02": [
        '黑砂色',
        '盾甲(雙面造型)'
    ],
    "03": [
        '青銅砂色',
        '外門:F7 生生不息',
        '內門:安平泰(雙面造型)'
    ],
    "05": [
        '紅鐵砂色',
        '外門:D6-1 禪(實木門花)',
        '內門:日中(雙面造型)'
    ],
    "06": [
        '黑砂色',
        '外門:F6 五福臨門',
        '內門:錢幣(雙面造型)'
    ],
    "07": [
        '淺灰砂色',
        '外門:F8 歡天喜地',
        '內門:如意(雙面造型)'
    ],
    "08": [
        '紅鐵砂色',
        '外門:F11三陽開泰',
        '內門:皓月(雙面造型)'
    ],
    "09": [
        '淺灰砂色',
        '如意(雙面造型)'
    ],
    "10": [
        '紅古銅色無上光',
        '錢幣(雙面造型)'
    ],
    "11":[
        '黑砂色',
        '謙卑 (雙面造型) (玫瑰色手工漆)'
    ],
    "12":[
        '紅鐵砂色',
        '石角 (雙面造型) '
    ],
    "13":[
        '黑砂色',
        '小金剛(雙面造型)'
    ],
    "15":[
        '黑砂色',
        '外門:D2琴棋',
        '內門:迷你金剛．KC327N染黑橡木(反面造型)'
    ]
};

let currentPattern = '01';

const doorImage = document.getElementById('door-image');
const patternNameDisplay = document.getElementById('pattern-name');
const dynamicFeatures = document.getElementById('dynamic-features'); 
const patternBtns = document.querySelectorAll('.pattern-btn');

function updateVisual() {
  
    patternNameDisplay.innerText = currentPattern;    
    

    doorImage.src = `../images/樣品圖/烤漆精雕門/${currentPattern}.jpg`;

    if (patternSpecs[currentPattern]) {
        dynamicFeatures.innerHTML = ""; 
        patternSpecs[currentPattern].forEach(text => {
            const li = document.createElement('li');
            li.innerText = text;
            dynamicFeatures.appendChild(li);
        });
    }


    if (tableData[currentPattern]) {
        priceTableBody.innerHTML = ""; 
        tableData[currentPattern].forEach(row => {

            const tr = document.createElement('tr');
            tr.innerHTML = `
                <td><b>${row.type}</b></td>
                <td>${row.size}</td>
                <td>${row.price1}</td>
                <td>${row.price2}</td>
            `;
            priceTableBody.appendChild(tr);
        });
    }
}



patternBtns.forEach(btn => {
    btn.addEventListener('click', function() {

        patternBtns.forEach(b => b.classList.remove('active'));

        this.classList.add('active');
        
        currentPattern = this.getAttribute('data-pattern');
        updateVisual();
    });
});


updateVisual();
